starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
/**
 * @file remote_server.c
 * @brief 远程服务器通信模块实现
 *
 * 实现 TCP 客户端连接到远程服务器，支持�?
 * - 遥测数据上传
 * - 控制指令接收
 * - CRTP 透传
 * - 心跳保活
 * - 断线自动重连
 */

#include "sdkconfig.h"

#ifdef CONFIG_REMOTE_SERVER_ENABLE

#include <string.h>
#include <sys/param.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/event_groups.h"

#include "esp_system.h"
#include "esp_netif.h"
#include "lwip/err.h"
#include "lwip/sockets.h"
#include "lwip/sys.h"
#include "lwip/netdb.h"

#include "remote_server.h"
#include "wifi_esp32.h"
#include "crtp.h"
#include "commander.h"
#include "vehicle_state.h"
#include "sitaw.h"
#include "stabilizer.h"
#include "stabilizer_types.h"
#include "log.h"
#include "param.h"
#include "pm_esplane.h"
#include "stm32_legacy.h"
#include "static_mem.h"

#define DEBUG_MODULE "REMOTE"
#include "debug_cf.h"

/*===========================================================================
 * 辅助�?
 *===========================================================================*/

#ifndef CLAMP
#define CLAMP(x, min, max) ((x) < (min) ? (min) : ((x) > (max) ? (max) : (x)))
#endif

#ifndef MIN
#define MIN(a, b) ((a) < (b) ? (a) : (b))
#endif

#ifndef MAX
#define MAX(a, b) ((a) > (b) ? (a) : (b))
#endif

/*===========================================================================
 * 配置参数
 *===========================================================================*/

#define REMOTE_SERVER_IP CONFIG_REMOTE_SERVER_IP
#define REMOTE_SERVER_PORT CONFIG_REMOTE_SERVER_PORT
#define RECONNECT_INTERVAL_MS (CONFIG_REMOTE_SERVER_RECONNECT_INTERVAL * 1000)
#define HEARTBEAT_INTERVAL_MS CONFIG_REMOTE_SERVER_HEARTBEAT_INTERVAL
#define TELEMETRY_INTERVAL_MS CONFIG_REMOTE_SERVER_TELEMETRY_INTERVAL
#define SOCKET_TIMEOUT_MS 5000

#define TX_QUEUE_SIZE 16
#define RX_BUFFER_SIZE 256

// UDP 广播发现配置
#define DISCOVERY_PORT 8081        // 广播监听端口
#define DISCOVERY_MAGIC 0x45535044 // "ESPD" 魔数
#define DISCOVERY_TIMEOUT_MS 5000  // 发现超时时间

// UDP 遥测发送配�?
// 包格�? [0x45 'E'][0x53 'S'][0x50 'P'][0x55 'U'][type=0x01][seq][payload]
#define UDP_TELEM_MAGIC_0 0x45
#define UDP_TELEM_MAGIC_1 0x53
#define UDP_TELEM_MAGIC_2 0x50
#define UDP_TELEM_MAGIC_3 0x55
#define UDP_TELEM_PKT_TELEMETRY 0x01
#define UDP_TELEM_HEADER_SIZE   6   // magic(4) + type(1) + seq(1)

// 任务配置
#define REMOTE_TX_TASK_NAME "remoteTx"
#define REMOTE_TX_TASK_PRI 3
#define REMOTE_TX_TASK_STACK 4096

#define REMOTE_RX_TASK_NAME "remoteRx"
#define REMOTE_RX_TASK_PRI 3
#define REMOTE_RX_TASK_STACK 4096

#define REMOTE_TELEM_TASK_NAME "remoteTelem"
#define REMOTE_TELEM_TASK_PRI 2
#define REMOTE_TELEM_TASK_STACK 3072

// Keep GCS/manual roll command direction aligned with SBUS/CRTP manual control
// conventions. Without this, a positive GCS roll command tilts opposite to the
// physical roll direction used elsewhere in the project.
#define REMOTE_SIGN_ROLL (-1.0f)

/*===========================================================================
 * 状态变�?
 *===========================================================================*/

static bool isInit = false;
static int sock = -1;
static volatile RemoteConnectionState connectionState = REMOTE_STATE_DISCONNECTED;
static SemaphoreHandle_t sockMutex = NULL;
static QueueHandle_t txQueue = NULL;
static EventGroupHandle_t eventGroup = NULL;

// 动态服务器地址
static char serverIP[16] = REMOTE_SERVER_IP; // 默认使用配置的IP
static bool serverDiscovered = false;

// UDP 遥测通道
static uint16_t udpTelemetryPort = 0; // 从发现响应读取，0=不可�?
static int      udpSock          = -1;
static uint8_t  udpTxSeq         = 0;
static bool remoteRollSignWarned = false;

#define EVT_CONNECTED (1 << 0)
#define EVT_DISCONNECTED (1 << 1)
#define EVT_RECONNECT (1 << 2)

// 统计信息
static uint32_t txPacketCount = 0;
static uint32_t rxPacketCount = 0;
static uint32_t reconnectCount = 0;
static uint32_t connectionStartTime = 0;

// 回调函数
static RemoteStateCallback stateCallback = NULL;
static RemoteControlCallback controlCallback = NULL;

// 序列�?
static uint16_t txSeq = 0;

// 发送队列项
typedef struct
{
    uint8_t type;
    uint16_t size;
    uint8_t data[REMOTE_MAX_PAYLOAD_SIZE];
} TxQueueItem;

// 日志变量
static uint8_t logConnected = 0;
static uint16_t logTxRate = 0;
static uint16_t logRxRate = 0;

// 远程控制模式（默认启用，当连接后且无其他控制源时接管�?
static volatile RemoteControlMode remoteControlMode = REMOTE_CTRL_MODE_ENABLED;

static int remoteServerGetSocketSnapshot(void)
{
    int currentSock = -1;

    if (xSemaphoreTake(sockMutex, M2T(100)) == pdTRUE)
    {
        currentSock = sock;
        xSemaphoreGive(sockMutex);
    }

    return currentSock;
}

static void remoteServerSetSocket(int newSock)
{
    if (xSemaphoreTake(sockMutex, M2T(100)) == pdTRUE)
    {
        sock = newSock;
        xSemaphoreGive(sockMutex);
    }
}

static int remoteServerDetachSocket(void)
{
    int detachedSock = -1;

    if (xSemaphoreTake(sockMutex, M2T(100)) == pdTRUE)
    {
        detachedSock = sock;
        sock = -1;
        xSemaphoreGive(sockMutex);
    }

    return detachedSock;
}

/*===========================================================================
 * 内部函数声明
 *===========================================================================*/

static void remoteServerRxTask(void *param);
static void remoteServerTxTask(void *param);
static void remoteServerTelemetryTask(void *param);
static bool connectToServer(void);
static void disconnectFromServer(void);
static void processReceivedPacket(const RemotePacketHeader *header, const uint8_t *payload);
static void handleControlPacket(const uint8_t *data, uint16_t size);
static void handleCRTPPacket(const uint8_t *data, uint16_t size);
static bool sendPacketInternal(RemotePacketType type, const uint8_t *data, uint16_t size);
static bool sendUDPTelemetry(const uint8_t *payload, uint16_t size);
static void updateConnectionState(RemoteConnectionState newState);
static bool validateControlCmd(const RemoteControlCmd *cmd);
static ActualFlightMode mapActualFlightMode(VehicleFlightMode mode)
{
    switch (mode)
    {
    case FLIGHT_MODE_POSITION:
    case FLIGHT_MODE_OFFBOARD:
    case FLIGHT_MODE_MISSION:
    case FLIGHT_MODE_RTL:
        return ACTUAL_MODE_POSHOLD;

