starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
    case FLIGHT_MODE_ALTITUDE:
    case FLIGHT_MODE_LAND:
    case FLIGHT_MODE_TAKEOFF:
        return ACTUAL_MODE_ALTHOLD;

    case FLIGHT_MODE_MANUAL:
    case FLIGHT_MODE_STABILIZE:
    default:
        return ACTUAL_MODE_STABILIZE;
    }
}

/*===========================================================================
 * 控制指令安全限制
 *===========================================================================*/

#define REMOTE_MAX_ROLL_RAW 4500     // ±45�?* 100
#define REMOTE_MAX_PITCH_RAW 4500    // ±45�?* 100
#define REMOTE_MAX_YAW_RATE_RAW 2000 // ±200�?�?* 10
#define REMOTE_MAX_THRUST 60000      // �?0%安全裕度
#define REMOTE_MIN_THRUST 0

// 统计变量
static uint32_t invalidCmdCount = 0;

/*===========================================================================
 * 公开 API 实现
 *===========================================================================*/

void remoteServerInit(void)
{
    if (isInit)
    {
        return;
    }

    DEBUG_PRINT("Initializing remote server module\n");
    DEBUG_PRINT("Server: %s:%d\n", REMOTE_SERVER_IP, REMOTE_SERVER_PORT);

    // 创建同步原语
    sockMutex = xSemaphoreCreateMutex();
    ASSERT(sockMutex);

    txQueue = xQueueCreate(TX_QUEUE_SIZE, sizeof(TxQueueItem));
    ASSERT(txQueue);

    eventGroup = xEventGroupCreate();
    ASSERT(eventGroup);

    isInit = true;
    DEBUG_PRINT("Remote server module resources created\n");
}

static bool isStarted = false; // 防止多次启动

void remoteServerStart(void)
{
    if (!isInit)
    {
        ESP_LOGE("REMOTE", "Remote server not initialized");
        return;
    }

    if (isStarted)
    {
        ESP_LOGW("REMOTE", "Remote server already started");
        return;
    }
    isStarted = true;

    ESP_LOGI("REMOTE", "Starting remote server tasks");

    // 创建任务
    xTaskCreate(remoteServerRxTask, REMOTE_RX_TASK_NAME, REMOTE_RX_TASK_STACK,
                NULL, REMOTE_RX_TASK_PRI, NULL);
    xTaskCreate(remoteServerTxTask, REMOTE_TX_TASK_NAME, REMOTE_TX_TASK_STACK,
                NULL, REMOTE_TX_TASK_PRI, NULL);
    xTaskCreate(remoteServerTelemetryTask, REMOTE_TELEM_TASK_NAME, REMOTE_TELEM_TASK_STACK,
                NULL, REMOTE_TELEM_TASK_PRI, NULL);

    ESP_LOGI("REMOTE", "Remote server tasks started");
}

bool remoteServerTest(void)
{
    return isInit;
}

RemoteConnectionState remoteServerGetState(void)
{
    return connectionState;
}

bool remoteServerIsConnected(void)
{
    return connectionState == REMOTE_STATE_CONNECTED;
}

void remoteServerSetStateCallback(RemoteStateCallback cb)
{
    stateCallback = cb;
}

void remoteServerSetControlCallback(RemoteControlCallback cb)
{
    controlCallback = cb;
}

bool remoteServerSendCRTP(const uint8_t *data, uint32_t size)
{
    if (!isInit || connectionState != REMOTE_STATE_CONNECTED)
    {
        return false;
    }
    return remoteServerSendPacket(REMOTE_PKT_CRTP, data, (uint16_t)size);
}

bool remoteServerSendPacket(RemotePacketType type, const uint8_t *data, uint16_t size)
{
    if (!isInit || size > REMOTE_MAX_PAYLOAD_SIZE)
    {
        return false;
    }

    TxQueueItem item;
    item.type = type;
    item.size = size;
    if (data && size > 0)
    {
        memcpy(item.data, data, size);
    }

    return xQueueSend(txQueue, &item, M2T(10)) == pdTRUE;
}

void remoteServerReconnect(void)
{
    if (isInit)
    {
        xEventGroupSetBits(eventGroup, EVT_RECONNECT);
    }
}

const char *remoteServerGetIP(void)
{
    return serverIP; // 返回动态发现的IP或配置的IP
}

void remoteServerGetStats(uint32_t *txCount, uint32_t *rxCount,
                          uint32_t *reconnects, uint32_t *uptime)
{
    if (txCount)
        *txCount = txPacketCount;
    if (rxCount)
        *rxCount = rxPacketCount;
    if (reconnects)
        *reconnects = reconnectCount;
    if (uptime)
    {
        if (connectionState == REMOTE_STATE_CONNECTED && connectionStartTime > 0)
        {
            *uptime = (xTaskGetTickCount() - connectionStartTime) / configTICK_RATE_HZ;
        }
        else
        {
            *uptime = 0;
        }
    }
}

/*===========================================================================
 * 连接管理
 *===========================================================================*/

/**
 * @brief 使用 UDP 广播发现服务�?IP 地址
 *
 * 监听服务器发送的广播包，格式�?
 * - 4字节魔数 (0x45535044 = "ESPD")
 * - 2字节端口�?(网络字节�?
 *
 * @return true 如果成功发现，false 超时
 */
/**
 * @brief 获取STA接口的网络信息并计算子网广播地址
 */
static uint32_t getSubnetBroadcastAddr(void)
{
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (netif == NULL)
    {
        ESP_LOGW("REMOTE", "Failed to get STA netif");
        return INADDR_BROADCAST;
    }

    esp_netif_ip_info_t ip_info;
    if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK)
    {
        ESP_LOGW("REMOTE", "Failed to get IP info");
        return INADDR_BROADCAST;
    }

    // 子网广播地址 = IP | (~netmask)
    uint32_t ip = ip_info.ip.addr;
    uint32_t mask = ip_info.netmask.addr;
    uint32_t bcast = ip | (~mask);

    ESP_LOGI("REMOTE", "Local IP: " IPSTR ", Mask: " IPSTR ", Broadcast: " IPSTR,
             IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask), IP2STR((esp_ip4_addr_t *)&bcast));

    return bcast;
}

static bool discoverServerViaUDP(void)
{
    ESP_LOGI("REMOTE", "Discovering server via UDP broadcast...");

    int discoverySock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (discoverySock < 0)
    {
        ESP_LOGE("REMOTE", "Failed to create discovery socket: errno=%d", errno);
        return false;
    }

    // 允许发送广�?
    int broadcast = 1;
    setsockopt(discoverySock, SOL_SOCKET, SO_BROADCAST, &broadcast, sizeof(broadcast));

    // 允许端口复用
    int reuse = 1;
    setsockopt(discoverySock, SOL_SOCKET, SO_REUSEADDR, &reuse, sizeof(reuse));

    // 设置接收超时 500ms
    struct timeval timeout;
    timeout.tv_sec = 0;
    timeout.tv_usec = 500 * 1000;
    setsockopt(discoverySock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

    // 绑定到任意端口（不绑�?081，避免和服务器冲突）
    struct sockaddr_in bindAddr;
    memset(&bindAddr, 0, sizeof(bindAddr));
    bindAddr.sin_family = AF_INET;
    bindAddr.sin_port = htons(0); // 系统自动分配端口
    bindAddr.sin_addr.s_addr = htonl(INADDR_ANY);

