starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
    if (bind(discoverySock, (struct sockaddr *)&bindAddr, sizeof(bindAddr)) < 0)
    {
        ESP_LOGE("REMOTE", "Failed to bind discovery socket: errno=%d", errno);
        close(discoverySock);
        return false;
    }

    // 获取绑定的端口号
    socklen_t addrLen = sizeof(bindAddr);
    getsockname(discoverySock, (struct sockaddr *)&bindAddr, &addrLen);
    ESP_LOGI("REMOTE", "Discovery socket bound to port %d", ntohs(bindAddr.sin_port));

    // 构造发现请求包（魔�?+ TCP端口=0表示请求�?
    uint8_t req[6] = {0};
    uint32_t magicNet = htonl(DISCOVERY_MAGIC);
    memcpy(req, &magicNet, 4);
    req[4] = 0;
    req[5] = 0;

    // 获取子网广播地址
    uint32_t subnetBcast = getSubnetBroadcastAddr();

    struct sockaddr_in bcastAddr;
    memset(&bcastAddr, 0, sizeof(bcastAddr));
    bcastAddr.sin_family = AF_INET;
    bcastAddr.sin_port = htons(DISCOVERY_PORT);

    TickType_t startTick = xTaskGetTickCount();
    TickType_t timeoutTicks = M2T(DISCOVERY_TIMEOUT_MS);
    int sendCount = 0;

    // 接收循环
    uint8_t buffer[16];
    struct sockaddr_in srcAddr;
    socklen_t srcLen;

    while ((xTaskGetTickCount() - startTick) < timeoutTicks)
    {
        // 每秒发送一次发现请�?
        if (sendCount == 0 || (xTaskGetTickCount() - startTick) >= M2T(sendCount * 1000))
        {
            // 发送到子网广播地址
            bcastAddr.sin_addr.s_addr = subnetBcast;
            int ret = sendto(discoverySock, req, sizeof(req), 0, (struct sockaddr *)&bcastAddr, sizeof(bcastAddr));
            ESP_LOGI("REMOTE", "Sent discovery request to subnet broadcast (ret=%d)", ret);

            // 也发送到全网广播地址
            bcastAddr.sin_addr.s_addr = htonl(INADDR_BROADCAST);
            ret = sendto(discoverySock, req, sizeof(req), 0, (struct sockaddr *)&bcastAddr, sizeof(bcastAddr));
            ESP_LOGI("REMOTE", "Sent discovery request to 255.255.255.255 (ret=%d)", ret);

            sendCount++;
        }

        // 尝试接收回应
        srcLen = sizeof(srcAddr);
        int len = recvfrom(discoverySock, buffer, sizeof(buffer), 0,
                           (struct sockaddr *)&srcAddr, &srcLen);

        if (len < 0)
        {
            if (errno == EAGAIN || errno == EWOULDBLOCK)
            {
                // 超时，继续循�?
                continue;
            }
            ESP_LOGW("REMOTE", "Discovery recv error: errno=%d", errno);
            continue;
        }

        ESP_LOGI("REMOTE", "Received %d bytes from %s:%d", len,
                 inet_ntoa(srcAddr.sin_addr), ntohs(srcAddr.sin_port));

        if (len < 6)
        {
            ESP_LOGW("REMOTE", "Discovery invalid packet (len=%d)", len);
            continue;
        }

        // 验证魔数
        uint32_t magic = (buffer[0] << 24) | (buffer[1] << 16) | (buffer[2] << 8) | buffer[3];
        if (magic != DISCOVERY_MAGIC)
        {
            ESP_LOGW("REMOTE", "Invalid discovery magic: 0x%08lX", (unsigned long)magic);
            continue;
        }

        // 检查TCP端口（非0表示服务器回应）
        uint16_t tcpPort = (buffer[4] << 8) | buffer[5];
        if (tcpPort == 0)
        {
            // 这是另一个ESP32的请求，忽略
            ESP_LOGD("REMOTE", "Ignoring discovery request from %s", inet_ntoa(srcAddr.sin_addr));
            continue;
        }

        // 读取 UDP 遥测端口�?字节扩展响应�?
        if (len >= 8)
        {
            udpTelemetryPort = (buffer[6] << 8) | buffer[7];
            ESP_LOGI("REMOTE", "UDP telemetry port: %d", udpTelemetryPort);
        }
        else
        {
            udpTelemetryPort = 0;
            ESP_LOGW("REMOTE", "Server response too short (%d bytes), UDP telemetry unavailable", len);
        }

        // 使用发送方�?IP 地址
        char *ipStr = inet_ntoa(srcAddr.sin_addr);
        strncpy(serverIP, ipStr, sizeof(serverIP) - 1);
        serverIP[sizeof(serverIP) - 1] = '\0';
        serverDiscovered = true;

        // 如果服务器支�?UDP 遥测，提前创�?UDP socket
        if (udpTelemetryPort > 0)
        {
            if (udpSock >= 0)
            {
                close(udpSock);
            }
            udpSock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
            if (udpSock < 0)
            {
                ESP_LOGE("REMOTE", "Failed to create UDP telemetry socket: errno=%d", errno);
                udpTelemetryPort = 0; // 回退�?TCP
            }
            else
            {
                ESP_LOGI("REMOTE", "UDP telemetry socket created (fd=%d)", udpSock);
            }
        }

        ESP_LOGI("REMOTE", "Discovered server at %s:%d (TCP=%d, UDP=%d)",
                 serverIP, REMOTE_SERVER_PORT, tcpPort, udpTelemetryPort);
        close(discoverySock);
        return true;
    }

    close(discoverySock);
    ESP_LOGW("REMOTE", "Discovery timeout after %d requests", sendCount);
    return false;
}

static void updateConnectionState(RemoteConnectionState newState)
{
    if (connectionState != newState)
    {
        connectionState = newState;
        logConnected = (newState == REMOTE_STATE_CONNECTED) ? 1 : 0;

        // 更新 VehicleState 中的 GCS 连接状�?
        vehicleSetGcsConnected(newState == REMOTE_STATE_CONNECTED);

        DEBUG_PRINT("Connection state: %d\n", newState);

        if (stateCallback)
        {
            stateCallback(newState);
        }
    }
}

static bool connectToServer(void)
{
    struct sockaddr_in destAddr;
    int err;
    int newSock;

    updateConnectionState(REMOTE_STATE_CONNECTING);

    // 如果还未发现服务器，尝试通过 UDP 广播发现
    if (!serverDiscovered)
    {
        if (!discoverServerViaUDP())
        {
            // 发现失败，不回退到硬编码 IP，等待下次重连重�?
            ESP_LOGW("REMOTE", "Server not found via UDP broadcast, will retry later");
            updateConnectionState(REMOTE_STATE_DISCONNECTED);
            return false;
        }
    }

    // 解析服务器地址（使用动态发现的IP�?
    destAddr.sin_addr.s_addr = inet_addr(serverIP);
    destAddr.sin_family = AF_INET;
    destAddr.sin_port = htons(REMOTE_SERVER_PORT);

    // 创建 socket
    newSock = socket(AF_INET, SOCK_STREAM, IPPROTO_IP);
    if (newSock < 0)
    {
        DEBUG_PRINT("Unable to create socket: errno %d\n", errno);
        updateConnectionState(REMOTE_STATE_ERROR);
        return false;
    }

    // 设置超时
    struct timeval timeout;
    timeout.tv_sec = SOCKET_TIMEOUT_MS / 1000;
    timeout.tv_usec = (SOCKET_TIMEOUT_MS % 1000) * 1000;
    setsockopt(newSock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));
    setsockopt(newSock, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout));

    // 连接服务�?
    ESP_LOGI("REMOTE", "Connecting to %s:%d...", serverIP, REMOTE_SERVER_PORT);
    err = connect(newSock, (struct sockaddr *)&destAddr, sizeof(destAddr));
    if (err != 0)
    {
        ESP_LOGE("REMOTE", "Socket connect failed: errno %d", errno);
        close(newSock);
        updateConnectionState(REMOTE_STATE_DISCONNECTED);
        return false;
    }

    remoteServerSetSocket(newSock);

    ESP_LOGI("REMOTE", "Connected to server!");
    updateConnectionState(REMOTE_STATE_CONNECTED);
    xEventGroupSetBits(eventGroup, EVT_CONNECTED);
    xEventGroupClearBits(eventGroup, EVT_DISCONNECTED);

