starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
    connectionStartTime = xTaskGetTickCount();
    reconnectCount++;

    return true;
}

static void disconnectFromServer(void)
{
    int tcpSock = remoteServerDetachSocket();

    if (tcpSock >= 0)
    {
        shutdown(tcpSock, SHUT_RDWR);
        close(tcpSock);
    }
    if (udpSock >= 0)
    {
        close(udpSock);
        udpSock = -1;
    }
    udpTelemetryPort = 0;
    // 重置发现状态，下次重连时重新通过 UDP 广播发现服务�?
    serverDiscovered = false;
    updateConnectionState(REMOTE_STATE_DISCONNECTED);
    xEventGroupSetBits(eventGroup, EVT_DISCONNECTED);
    xEventGroupClearBits(eventGroup, EVT_CONNECTED);
    connectionStartTime = 0;
}

/*===========================================================================
 * 发送任�?
 *===========================================================================*/

static bool sendPacketInternal(RemotePacketType type, const uint8_t *data, uint16_t size)
{
    if (connectionState != REMOTE_STATE_CONNECTED)
    {
        return false;
    }

    // 构造包�?
    RemotePacketHeader header;
    header.magic[0] = REMOTE_MAGIC_0;
    header.magic[1] = REMOTE_MAGIC_1;
    header.version = REMOTE_PROTOCOL_VERSION;
    header.type = type;
    header.seq = txSeq++;
    header.length = size;

    // 发送（加锁保护�?
    bool success = false;
    if (xSemaphoreTake(sockMutex, M2T(100)) == pdTRUE)
    {
        int currentSock = sock;

        if (currentSock < 0)
        {
            xSemaphoreGive(sockMutex);
            return false;
        }

        // 先发包头
        int sent = send(currentSock, &header, sizeof(header), 0);
        if (sent == sizeof(header))
        {
            // 再发数据
            if (size > 0 && data)
            {
                sent = send(currentSock, data, size, 0);
                success = (sent == size);
            }
            else
            {
                success = true;
            }
        }
        xSemaphoreGive(sockMutex);

        if (success)
        {
            txPacketCount++;
        }
    }

    return success;
}

/**
 * @brief 通过 UDP 发送遥测数据（高频路径，不占用 TCP 带宽�?
 * 包格�? [4字节魔数 ESPU] + [1字节类型] + [1字节序号] + [payload]
 */
static bool sendUDPTelemetry(const uint8_t *payload, uint16_t size)
{
    if (udpSock < 0 || udpTelemetryPort == 0 || !serverDiscovered)
    {
        return false;
    }

    // 构�?UDP 包头 (6字节)
    uint8_t header[UDP_TELEM_HEADER_SIZE];
    header[0] = UDP_TELEM_MAGIC_0;
    header[1] = UDP_TELEM_MAGIC_1;
    header[2] = UDP_TELEM_MAGIC_2;
    header[3] = UDP_TELEM_MAGIC_3;
    header[4] = UDP_TELEM_PKT_TELEMETRY;
    header[5] = udpTxSeq++;

    // 组装完整�?
    uint16_t totalSize = UDP_TELEM_HEADER_SIZE + size;
    uint8_t *buf = (uint8_t *)malloc(totalSize);
    if (!buf)
    {
        return false;
    }
    memcpy(buf, header, UDP_TELEM_HEADER_SIZE);
    memcpy(buf + UDP_TELEM_HEADER_SIZE, payload, size);

    struct sockaddr_in destAddr;
    destAddr.sin_family = AF_INET;
    destAddr.sin_port   = htons(udpTelemetryPort);
    destAddr.sin_addr.s_addr = inet_addr(serverIP);

    int ret = sendto(udpSock, buf, totalSize, 0,
                     (struct sockaddr *)&destAddr, sizeof(destAddr));
    free(buf);

    return ret == totalSize;
}

static void remoteServerTxTask(void *param)
{
    TxQueueItem item;
    TickType_t lastHeartbeat = 0;

    ESP_LOGI("REMOTE", "TX task started, attempting connection...");

    // 等待初始连接
    while (!connectToServer())
    {
        ESP_LOGW("REMOTE", "Connection failed, retrying in %d ms...", RECONNECT_INTERVAL_MS);
        vTaskDelay(M2T(RECONNECT_INTERVAL_MS));
    }

    while (true)
    {
        // 检查是否需要重�?
        EventBits_t bits = xEventGroupGetBits(eventGroup);
        if ((bits & EVT_DISCONNECTED) || (bits & EVT_RECONNECT))
        {
            xEventGroupClearBits(eventGroup, EVT_RECONNECT);
            DEBUG_PRINT("Reconnecting...\n");
            disconnectFromServer();
            vTaskDelay(M2T(RECONNECT_INTERVAL_MS));
            connectToServer();
            continue;
        }

        // 从队列取数据发�?
        if (xQueueReceive(txQueue, &item, M2T(HEARTBEAT_INTERVAL_MS / 2)) == pdTRUE)
        {
            if (!sendPacketInternal(item.type, item.data, item.size))
            {
                // 发送失败，触发重连
                xEventGroupSetBits(eventGroup, EVT_DISCONNECTED);
            }
        }

        // 定期发送心�?
        TickType_t now = xTaskGetTickCount();
        if ((now - lastHeartbeat) >= M2T(HEARTBEAT_INTERVAL_MS))
        {
            uint32_t timestamp = now;
            if (!sendPacketInternal(REMOTE_PKT_HEARTBEAT, (uint8_t *)&timestamp, sizeof(timestamp)))
            {
                xEventGroupSetBits(eventGroup, EVT_DISCONNECTED);
            }
            lastHeartbeat = now;
        }
    }
}

/*===========================================================================
 * 接收任务
 *===========================================================================*/

static void remoteServerRxTask(void *param)
{
    uint8_t rxBuffer[RX_BUFFER_SIZE];
    int rxLen = 0;
    int parsePos = 0;

    ESP_LOGI("REMOTE", "RX task started, waiting for connection...");

    while (true)
    {
        // 等待连接建立
        xEventGroupWaitBits(eventGroup, EVT_CONNECTED, pdFALSE, pdTRUE, portMAX_DELAY);

        int currentSock = remoteServerGetSocketSnapshot();

        if (currentSock < 0)
        {
            vTaskDelay(M2T(100));
            continue;
        }

        // 接收数据
        int len = recv(currentSock, rxBuffer + rxLen, RX_BUFFER_SIZE - rxLen, 0);
        if (len < 0)
        {
            if (errno == EAGAIN || errno == EWOULDBLOCK)
            {
                // 超时，继�?
                continue;
            }
            ESP_LOGE("REMOTE", "recv failed: errno %d", errno);
            xEventGroupSetBits(eventGroup, EVT_DISCONNECTED);
            continue;
        }
        else if (len == 0)
        {
            // 连接关闭
            ESP_LOGW("REMOTE", "Server closed connection");
            xEventGroupSetBits(eventGroup, EVT_DISCONNECTED);
            continue;
        }

        rxLen += len;

        // 解析接收到的数据�?
        parsePos = 0;
        while (parsePos + sizeof(RemotePacketHeader) <= rxLen)
        {
            RemotePacketHeader *header = (RemotePacketHeader *)(rxBuffer + parsePos);

            // 验证魔数
            if (header->magic[0] != REMOTE_MAGIC_0 || header->magic[1] != REMOTE_MAGIC_1)
            {
                // 同步丢失，跳过一个字�?
                parsePos++;
                continue;
            }

