starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
            // 检查是否有完整的包
            int totalLen = sizeof(RemotePacketHeader) + header->length;
            if (parsePos + totalLen > rxLen)
            {
                // 数据不完整，等待更多
                break;
            }

            // 处理�?
            uint8_t *payload = rxBuffer + parsePos + sizeof(RemotePacketHeader);
            processReceivedPacket(header, payload);
            rxPacketCount++;

            parsePos += totalLen;
        }

        // 移动剩余数据到缓冲区开�?
        if (parsePos > 0 && parsePos < rxLen)
        {
            memmove(rxBuffer, rxBuffer + parsePos, rxLen - parsePos);
            rxLen -= parsePos;
        }
        else if (parsePos >= rxLen)
        {
            rxLen = 0;
        }
    }
}

static void processReceivedPacket(const RemotePacketHeader *header, const uint8_t *payload)
{
    switch (header->type)
    {
    case REMOTE_PKT_HEARTBEAT:
        // 服务器心跳响应，可用�?RTT 计算
        break;

    case REMOTE_PKT_CONTROL:
        handleControlPacket(payload, header->length);
        break;

    case REMOTE_PKT_CRTP:
        handleCRTPPacket(payload, header->length);
        break;

    case REMOTE_PKT_ACK:
        // 确认�?
        break;

    case REMOTE_PKT_CONFIG:
        // 配置包，可用于运行时参数调整
        DEBUG_PRINT("Received config packet\n");
        break;

    default:
        DEBUG_PRINT("Unknown packet type: %d\n", header->type);
        break;
    }
}

static void handleControlPacket(const uint8_t *data, uint16_t size)
{
    if (size < sizeof(RemoteControlCmd))
    {
        ESP_LOGW("REMOTE", "Control packet too small: %d", size);
        return;
    }

    const RemoteControlCmd *cmd = (const RemoteControlCmd *)data;

    ESP_LOGI("REMOTE", "CMD: type=0x%02X, mode=%d", cmd->cmdType, cmd->mode);

    // 输入验证
    if (!validateControlCmd(cmd))
    {
        invalidCmdCount++;
        ESP_LOGW("REMOTE", "Invalid control command rejected (total: %lu)", invalidCmdCount);
        return;
    }

    // 如果注册了回调，调用回调
    if (controlCallback)
    {
        controlCallback(cmd);
    }

    // 根据指令类型处理
    setpoint_t setpoint = {0};

    switch (cmd->cmdType)
    {
    case CTRL_CMD_RPYT:
        setpoint.mode.roll = modeAbs;
        setpoint.mode.pitch = modeAbs;
        setpoint.mode.yaw = modeVelocity;
        // 钳位到安全范�?
        if (!remoteRollSignWarned)
        {
            DEBUG_PRINT("WARNING: remote roll command uses sign compensation to match SBUS/CRTP manual roll convention\n");
            remoteRollSignWarned = true;
        }
        setpoint.attitude.roll = REMOTE_SIGN_ROLL *
                                 (((float)CLAMP(cmd->roll, -REMOTE_MAX_ROLL_RAW, REMOTE_MAX_ROLL_RAW)) / 100.0f);
        setpoint.attitude.pitch = ((float)CLAMP(cmd->pitch, -REMOTE_MAX_PITCH_RAW, REMOTE_MAX_PITCH_RAW)) / 100.0f;
        setpoint.attitudeRate.yaw = ((float)CLAMP(cmd->yaw, -REMOTE_MAX_YAW_RATE_RAW, REMOTE_MAX_YAW_RATE_RAW)) / 10.0f;
        setpoint.thrust = CLAMP(cmd->thrust, REMOTE_MIN_THRUST, REMOTE_MAX_THRUST);
        // 根据飞行模式转换 setpoint 语义
        commanderApplyFlightMode(&setpoint);
        commanderSetSetpoint(&setpoint, COMMANDER_PRIORITY_REMOTE);
        break;

    case CTRL_CMD_EMERGENCY:
        // 紧急停�?- 使用新的vehicle_state系统
        vehicleEmergencyStop();
        // 同时发送停止命�?
        setpoint.thrust = 0;
        setpoint.mode.roll = modeDisable;
        setpoint.mode.pitch = modeDisable;
        setpoint.mode.yaw = modeDisable;
        commanderSetSetpoint(&setpoint, COMMANDER_PRIORITY_EXTRX);
        DEBUG_PRINT("EMERGENCY STOP received!\n");
        break;

    case CTRL_CMD_HOVER:
        // 悬停模式
        setpoint.mode.x = modeVelocity;
        setpoint.mode.y = modeVelocity;
        setpoint.mode.z = modeAbs;
        setpoint.velocity.x = 0;
        setpoint.velocity.y = 0;
        // 高度限制在合理范围内 (0.1m - 3m)
        {
            float targetHeight = cmd->thrust / 1000.0f;
            targetHeight = (targetHeight < 0.1f) ? 0.1f : ((targetHeight > 3.0f) ? 3.0f : targetHeight);
            setpoint.position.z = targetHeight;
        }
        commanderSetSetpoint(&setpoint, COMMANDER_PRIORITY_REMOTE);
        break;

    case CTRL_CMD_LAND:
        // 降落模式 - 设置飞行模式并发送降落命�?
        vehicleSetFlightMode(FLIGHT_MODE_LAND);
        setpoint.mode.z = modeVelocity;
        setpoint.velocity.z = -0.3f; // 下降速度 0.3m/s
        commanderSetSetpoint(&setpoint, COMMANDER_PRIORITY_REMOTE);
        DEBUG_PRINT("LAND command received\n");
        break;

    case CTRL_CMD_ARM:
        // 解锁 - 使用新的vehicle_state系统
        if (vehicleArm(false))
        {
            DEBUG_PRINT("ARM command: SUCCESS\n");
        }
        else
        {
            DEBUG_PRINT("ARM command: FAILED - %s\n", vehicleGetArmFailReasonStr());
        }
        break;

    case CTRL_CMD_DISARM:
        // 上锁 - 使用新的vehicle_state系统
        vehicleDisarm(false);
        // 同时发送停止命�?
        setpoint.thrust = 0;
        setpoint.mode.roll = modeDisable;
        setpoint.mode.pitch = modeDisable;
        setpoint.mode.yaw = modeDisable;
        commanderSetSetpoint(&setpoint, COMMANDER_PRIORITY_REMOTE);
        DEBUG_PRINT("DISARM command received\n");
        break;

    case CTRL_CMD_SET_CONTROL_MODE:
        // 设置远程控制模式 - mode字段存储控制模式
        if (cmd->mode <= REMOTE_CTRL_MODE_SHARED)
        {
            remoteControlMode = (RemoteControlMode)cmd->mode;
            ESP_LOGI("REMOTE", "Control mode set to: %d", remoteControlMode);
        }
        else
        {
            ESP_LOGW("REMOTE", "Invalid control mode: %d", cmd->mode);
        }
        break;

    default:
        DEBUG_PRINT("Unknown control command type: %d\n", cmd->cmdType);
        break;
    }
}

/**
 * @brief 验证控制指令是否在安全范围内
 */
static bool validateControlCmd(const RemoteControlCmd *cmd)
{
    if (cmd == NULL)
    {
        return false;
    }

    // 检查指令类型是否有�?
    // CTRL_CMD_SET_CONTROL_MODE = 0x10, 其他命令�?0x00-0x07 范围
    if (cmd->cmdType > CTRL_CMD_DISARM && cmd->cmdType != CTRL_CMD_SET_CONTROL_MODE)
    {
        return false;
    }

    // 对于RPYT模式，检查范围（允许一定裕度）
    if (cmd->cmdType == CTRL_CMD_RPYT)
    {
        // 超出范围200%视为无效（可能是数据损坏�?
        if (abs(cmd->roll) > REMOTE_MAX_ROLL_RAW * 2 ||
            abs(cmd->pitch) > REMOTE_MAX_PITCH_RAW * 2 ||
            abs(cmd->yaw) > REMOTE_MAX_YAW_RATE_RAW * 2)
        {
            return false;
        }

        // 推力超出最大�?50%视为无效
        if (cmd->thrust > 65535)
        {
            return false;
        }
    }

