starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
    return true;
}

static void handleCRTPPacket(const uint8_t *data, uint16_t size)
{
    if (size < 1 || size > CRTP_MAX_DATA_SIZE + 1)
    {
        ESP_LOGW("REMOTE", "CRTP packet invalid size=%d", size);
        return;
    }

    // �?CRTP 包发送到本地 CRTP 处理系统
    CRTPPacket p = {0};
    p.size = size - 1;
    memcpy(p.raw, data, size);

    ESP_LOGI("REMOTE", "CRTP RX: port=%d ch=%d size=%d", p.port, p.channel, p.size);

    if (!crtpInjectPacket(&p))
    {
        ESP_LOGW("REMOTE", "Dropped CRTP packet port=%d ch=%d", p.port, p.channel);
    }
}

/*===========================================================================
 * 遥测上报任务
 *===========================================================================*/

// 使用 log 系统获取状态数�?
#include "log.h"

static void remoteServerTelemetryTask(void *param)
{
    RemoteTelemetryData telemetry;
    TickType_t lastWakeTime;

    // 获取日志变量ID（只需要获取一次）
    static bool logIdsInit = false;
    static logVarId_t rollId, pitchId, yawId;
    static logVarId_t gyroXId, gyroYId, gyroZId;
    static logVarId_t accXId, accYId, accZId;
    static logVarId_t motorM1Id, motorM2Id, motorM3Id, motorM4Id;
    // V3.2 新增：高度和速度日志变量ID
    static logVarId_t estZId, estVxId, estVyId, estVzId;
    static logVarId_t baroHeightId, tofDistanceId;
    // V3.3 新增：机体坐标系速度
    static logVarId_t bodyVxId, bodyVyId;
    // V3.4 新增：磁力计
    static logVarId_t magXId, magYId, magZId, magHeadingId;
    static uint32_t lastMotorPrintTick = 0;

    // 等待一段时间让日志系统初始�?
    vTaskDelay(M2T(2000));
    lastWakeTime = xTaskGetTickCount();

    while (true)
    {
        vTaskDelayUntil(&lastWakeTime, M2T(TELEMETRY_INTERVAL_MS));

        if (connectionState != REMOTE_STATE_CONNECTED)
        {
            continue;
        }

        // 初始化日志变量ID
        if (!logIdsInit)
        {
            rollId = logGetVarId("stabilizer", "roll");
            pitchId = logGetVarId("stabilizer", "pitch");
            yawId = logGetVarId("stabilizer", "yaw");

            gyroXId = logGetVarId("gyro", "x");
            gyroYId = logGetVarId("gyro", "y");
            gyroZId = logGetVarId("gyro", "z");

            accXId = logGetVarId("acc", "x");
            accYId = logGetVarId("acc", "y");
            accZId = logGetVarId("acc", "z");

            // 获取电机输出日志ID
            // 优先使用power_distribution的motor组（正常飞行输出），电机测试时motors组值会覆盖
            motorM1Id = logGetVarId("motor", "m1");
            motorM2Id = logGetVarId("motor", "m2");
            motorM3Id = logGetVarId("motor", "m3");
            motorM4Id = logGetVarId("motor", "m4");

            // 若motor组不存在则回退到motors组（电机测试模块�?
            if (!LOG_VARID_IS_VALID(motorM1Id))
                motorM1Id = logGetVarId("motors", "m1");
            if (!LOG_VARID_IS_VALID(motorM2Id))
                motorM2Id = logGetVarId("motors", "m2");
            if (!LOG_VARID_IS_VALID(motorM3Id))
                motorM3Id = logGetVarId("motors", "m3");
            if (!LOG_VARID_IS_VALID(motorM4Id))
                motorM4Id = logGetVarId("motors", "m4");

            // V3.2 新增：获取高度和速度日志ID
            // 使用stateEstimate组（导出的最终状态），而非kalman内部状�?
            estZId = logGetVarId("stateEstimate", "z");
            estVxId = logGetVarId("stateEstimate", "vx");
            estVyId = logGetVarId("stateEstimate", "vy");
            estVzId = logGetVarId("stateEstimate", "vz");
            // 校准后的气压高度 (kalman_baro�?
            baroHeightId = logGetVarId("kalman_baro", "height");
            // ToF距离 (mtf01�?
            tofDistanceId = logGetVarId("mtf01", "distance");

            // V3.3 新增：机体坐标系速度
            // 从kalman滤波器内部状态获�?(单位: m/s)
            bodyVxId = logGetVarId("kalman", "statePX");
            bodyVyId = logGetVarId("kalman", "statePY");

            // V3.4 新增：磁力计数据
            magXId = logGetVarId("mag", "x");
            magYId = logGetVarId("mag", "y");
            magZId = logGetVarId("mag", "z");
            magHeadingId = logGetVarId("mag", "heading");

            logIdsInit = true;
            DEBUG_PRINT("Telemetry log IDs initialized\n");
            DEBUG_PRINT("  estZ=%d, estVx=%d, estVy=%d, estVz=%d, baro=%d, tof=%d\n",
                        estZId, estVxId, estVyId, estVzId, baroHeightId, tofDistanceId);
            DEBUG_PRINT("  bodyVx=%d, bodyVy=%d (valid: %d, %d)\n",
                        bodyVxId, bodyVyId, LOG_VARID_IS_VALID(bodyVxId), LOG_VARID_IS_VALID(bodyVyId));
            DEBUG_PRINT("WARNING: telemetry.gyroY uses pitch sign compensation to match telemetry.pitch\n");
        }

        // 填充遥测数据
        // 姿态角（从日志获取，单位：度）
        telemetry.roll = (int16_t)(logGetFloat(rollId) * 100);
        telemetry.pitch = (int16_t)(logGetFloat(pitchId) * 100);
        telemetry.yaw = (int16_t)(logGetFloat(yawId) * 100);

        // 角速度（从陀螺仪获取，单位：deg/s�?
        telemetry.gyroX = (int16_t)(logGetFloat(gyroXId) * 10);
        // Export pitch rate in the same sign convention as telemetry.pitch and PID pitch control.
        telemetry.gyroY = (int16_t)(-logGetFloat(gyroYId) * 10);
        telemetry.gyroZ = (int16_t)(logGetFloat(gyroZId) * 10);

        // 加速度（单位：g，转换为 mg�?
        telemetry.accX = (int16_t)(logGetFloat(accXId) * 1000);
        telemetry.accY = (int16_t)(logGetFloat(accYId) * 1000);
        telemetry.accZ = (int16_t)(logGetFloat(accZId) * 1000);

        // 电池状态（暂时固定�?00%�?
        telemetry.battVoltage = 4200; // 4.2V
        telemetry.battPercent = 100;

        // 飞行状态（从新的vehicle_state系统获取 - PX4风格�?
        VehicleState vstate = vehicleStateGet();
        telemetry.armingState = (uint8_t)vstate.armingState;
        telemetry.flightMode = (uint8_t)vstate.flightMode;
        telemetry.flightPhase = (uint8_t)vstate.flightPhase;
        telemetry.failsafeState = (uint8_t)vstate.failsafeState;

        // 状态标志位
        telemetry.statusFlags = 0;
        if (vstate.isArmed)
            telemetry.statusFlags |= STATUS_FLAG_ARMED;
        if (vstate.isFlying)
            telemetry.statusFlags |= STATUS_FLAG_FLYING;
        if (vstate.isEmergency)
            telemetry.statusFlags |= STATUS_FLAG_EMERGENCY;
        if (vstate.isRcConnected)
            telemetry.statusFlags |= STATUS_FLAG_RC_CONNECTED;
        if (vstate.isGcsConnected)
            telemetry.statusFlags |= STATUS_FLAG_GCS_CONNECTED;
        if (vstate.isBatteryLow)
            telemetry.statusFlags |= STATUS_FLAG_BATTERY_LOW;
#ifdef SITAW_TU_ENABLED
        if (sitAwTuDetected())
            telemetry.statusFlags |= STATUS_FLAG_TUMBLED;
#endif
        if (stabilizerIsArmThrottleBlocked())
            telemetry.statusFlags |= STATUS_FLAG_ARM_THROTTLE_BLOCK;

