starliliko/diy-drone-powered-by-esp32s3/software/firmware/components/core/crazyflie/modules/src/remote_server.c
        // 飞行时间
        telemetry.flightTime = vstate.flightTime;

        // 时间�?
        telemetry.timestamp = xTaskGetTickCount();

        // === V3 新增字段 ===
        // 实际飞行姿态模式（由传感器能力决定�?
        VehicleFlightMode actualMode = vehicleGetFlightMode();
        telemetry.actualFlightMode = (uint8_t)mapActualFlightMode(actualMode);

        // 控制来源逻辑�?
        // 1. 遥控器连接时：控制源=遥控器（最高优先级），远程可切换为协同模式
        // 2. 无遥控器 + 远程控制启用 + 已连接：控制�?地面�?
        // 3. 无遥控器 + 远程控制禁用/未连接：控制�?无控�?
        // 4. 协同模式：遥控器有输入时显示遥控器，否则显示地面�?
        int activePriority = commanderGetActivePriority();
        bool rcConnected = vstate.isRcConnected;
        bool gcsConnected = (connectionState == REMOTE_STATE_CONNECTED);

        if (activePriority == COMMANDER_PRIORITY_EXTRX)
        {
            // 遥控器正在控制（最高优先级�?
            telemetry.controlSource = (uint8_t)COMMANDER_PRIORITY_EXTRX;
        }
        else if (rcConnected && remoteControlMode == REMOTE_CTRL_MODE_SHARED && gcsConnected)
        {
            // 协同模式：遥控器连接但没有输入，地面站可以控�?
            if (activePriority == COMMANDER_PRIORITY_REMOTE)
            {
                telemetry.controlSource = (uint8_t)COMMANDER_PRIORITY_REMOTE;
            }
            else
            {
                // 协同模式下无活动控制，显示遥控器（遥控器始终优先�?
                telemetry.controlSource = (uint8_t)COMMANDER_PRIORITY_EXTRX;
            }
        }
        else if (!rcConnected && gcsConnected && remoteControlMode == REMOTE_CTRL_MODE_ENABLED)
        {
            // 无遥控器 + 远程控制启用 + 已连接：控制�?地面�?
            telemetry.controlSource = (uint8_t)COMMANDER_PRIORITY_REMOTE;
        }
        else if (activePriority != COMMANDER_PRIORITY_DISABLE)
        {
            // 其他活动控制�?
            telemetry.controlSource = (uint8_t)activePriority;
        }
        else
        {
            // 无活动控制源
            telemetry.controlSource = (uint8_t)COMMANDER_PRIORITY_DISABLE;
        }

        // 远程控制模式
        telemetry.remoteCtrlMode = (uint8_t)remoteControlMode;

        // === 电机输出 (V3.1新增) ===
        if (LOG_VARID_IS_VALID(motorM1Id))
        {
            unsigned int m1 = logGetUint(motorM1Id);
            telemetry.motorPower[0] = (uint16_t)(m1 > 65535 ? 65535 : m1);
        }
        else
        {
            telemetry.motorPower[0] = 0;
        }

        if (LOG_VARID_IS_VALID(motorM2Id))
        {
            unsigned int m2 = logGetUint(motorM2Id);
            telemetry.motorPower[1] = (uint16_t)(m2 > 65535 ? 65535 : m2);
        }
        else
        {
            telemetry.motorPower[1] = 0;
        }

        if (LOG_VARID_IS_VALID(motorM3Id))
        {
            unsigned int m3 = logGetUint(motorM3Id);
            telemetry.motorPower[2] = (uint16_t)(m3 > 65535 ? 65535 : m3);
        }
        else
        {
            telemetry.motorPower[2] = 0;
        }

        if (LOG_VARID_IS_VALID(motorM4Id))
        {
            unsigned int m4 = logGetUint(motorM4Id);
            telemetry.motorPower[3] = (uint16_t)(m4 > 65535 ? 65535 : m4);
        }
        else
        {
            telemetry.motorPower[3] = 0;
        }

        // 串口输出电机实时数据�?Hz�?
        if ((xTaskGetTickCount() - lastMotorPrintTick) > M2T(1000))
        {
            lastMotorPrintTick = xTaskGetTickCount();
            DEBUG_PRINT("MOTOR_OUT: M1=%u M2=%u M3=%u M4=%u\n",
                        telemetry.motorPower[0], telemetry.motorPower[1],
                        telemetry.motorPower[2], telemetry.motorPower[3]);
        }

        // === V3.2 新增：高度和速度数据 ===
        // 估计器高�?(kalman stateZ, 单位: m -> mm)
        if (LOG_VARID_IS_VALID(estZId))
        {
            telemetry.estAltitude = (int32_t)(logGetFloat(estZId) * 1000.0f);
        }
        else
        {
            telemetry.estAltitude = 0;
        }

        // 校准后的气压计高�?(单位: m -> mm)
        if (LOG_VARID_IS_VALID(baroHeightId))
        {
            telemetry.baroAltitude = (int32_t)(logGetFloat(baroHeightId) * 1000.0f);
        }
        else
        {
            telemetry.baroAltitude = 0;
        }

        // ToF距离 (mtf01 distance, 单位: mm)
        if (LOG_VARID_IS_VALID(tofDistanceId))
        {
            telemetry.tofDistance = (int32_t)logGetUint(tofDistanceId);
        }
        else
        {
            telemetry.tofDistance = 0;
        }

        // 估计器速度X (kalman statePX, 单位: m/s -> mm/s)
        if (LOG_VARID_IS_VALID(estVxId))
        {
            telemetry.estVelX = (int16_t)(logGetFloat(estVxId) * 1000.0f);
        }
        else
        {
            telemetry.estVelX = 0;
        }

        // 估计器速度Y (kalman statePY, 单位: m/s -> mm/s)
        if (LOG_VARID_IS_VALID(estVyId))
        {
            telemetry.estVelY = (int16_t)(logGetFloat(estVyId) * 1000.0f);
        }
        else
        {
            telemetry.estVelY = 0;
        }

        // 估计器速度Z (世界坐标系垂直速度, 单位: m/s -> mm/s)
        if (LOG_VARID_IS_VALID(estVzId))
        {
            telemetry.estVelZ = (int16_t)(logGetFloat(estVzId) * 1000.0f);
        }
        else
        {
            telemetry.estVelZ = 0;
        }

        // 机体坐标系速度 (V3.3新增)
        if (LOG_VARID_IS_VALID(bodyVxId))
        {
            float rawVx = logGetFloat(bodyVxId);
            telemetry.bodyVelX = (int16_t)(rawVx * 1000.0f);
            // 调试打印（每5秒一次）
            static uint32_t lastBodyVelPrint = 0;
            if (xTaskGetTickCount() - lastBodyVelPrint > pdMS_TO_TICKS(5000))
            {
                DEBUG_PRINT("[BodyVel] statePX=%.4f, statePY=%.4f -> mm/s: %d, %d\n",
                            rawVx, logGetFloat(bodyVyId), telemetry.bodyVelX, telemetry.bodyVelY);
                lastBodyVelPrint = xTaskGetTickCount();
            }
        }
        else
        {
            telemetry.bodyVelX = 0;
        }
        if (LOG_VARID_IS_VALID(bodyVyId))
        {
            telemetry.bodyVelY = (int16_t)(logGetFloat(bodyVyId) * 1000.0f);
        }
        else
        {
            telemetry.bodyVelY = 0;
        }

        // 磁力计数据 (V3.4新增)
        telemetry.magX = LOG_VARID_IS_VALID(magXId) ? (int16_t)(logGetFloat(magXId) * 1000.0f) : 0;
        telemetry.magY = LOG_VARID_IS_VALID(magYId) ? (int16_t)(logGetFloat(magYId) * 1000.0f) : 0;
        telemetry.magZ = LOG_VARID_IS_VALID(magZId) ? (int16_t)(logGetFloat(magZId) * 1000.0f) : 0;
        telemetry.magHeading = LOG_VARID_IS_VALID(magHeadingId) ? (int16_t)(logGetFloat(magHeadingId) * 100.0f) : 0;

        // 发送遥测数�?
        // 优先�?UDP（高频、低延迟），UDP 不可用时回退 TCP
        if (udpSock >= 0 && udpTelemetryPort > 0)
        {
            bool udpOk = sendUDPTelemetry((uint8_t *)&telemetry, sizeof(telemetry));
            if (!udpOk)
            {
                ESP_LOGW("REMOTE", "UDP telemetry send failed, fallback to TCP");
                remoteServerSendPacket(REMOTE_PKT_TELEMETRY,
                                       (uint8_t *)&telemetry, sizeof(telemetry));
            }
        }
        else
        {
            // 旧服务器�?UDP 不可用，使用 TCP
            remoteServerSendPacket(REMOTE_PKT_TELEMETRY,
                                   (uint8_t *)&telemetry, sizeof(telemetry));
        }
    }
}

/*===========================================================================
 * 控制模式管理 API
 *===========================================================================*/

RemoteControlMode remoteServerGetControlMode(void)
{
    return remoteControlMode;
}

void remoteServerSetControlMode(RemoteControlMode mode)
{
    if (mode <= REMOTE_CTRL_MODE_SHARED)
    {
        remoteControlMode = mode;
        DEBUG_PRINT("Remote control mode set to: %d\n", mode);
    }
}

/*===========================================================================
 * 日志和参�?
 *===========================================================================*/

LOG_GROUP_START(remote)
LOG_ADD(LOG_UINT8, connected, &logConnected)
LOG_ADD(LOG_UINT16, txRate, &logTxRate)
LOG_ADD(LOG_UINT16, rxRate, &logRxRate)
LOG_ADD(LOG_UINT32, invalidCmd, &invalidCmdCount)
LOG_GROUP_STOP(remote)

#endif /* CONFIG_REMOTE_SERVER_ENABLE */
